notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Games App Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-03-25"/>
<meta name="author" content="Nick F"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Games App Notes</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 About </a></li>
<li><a href="#sec-2">2 Features </a>
<ul>
<li><a href="#sec-2.1">2.1 Edit a System </a></li>
<li><a href="#sec-2.2">2.2 Edit a Game </a></li>
<li><a href="#sec-2.3">2.3 Add a new System </a></li>
<li><a href="#sec-2.4">2.4 Add a new Game </a></li>
<li><a href="#sec-2.5">2.5 Better flow </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About </h2>
<div class="outline-text-2" id="text-1">

<p>A simple app to track my video game collection
Also a testing ground to learn about Single Page Applications in Backbone/Marionette.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Features </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> <span class="done DONE"> DONE</span> Edit a System </h3>
<div class="outline-text-3" id="text-2.1">

</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> <span class="todo TODO"> TODO</span> Edit a Game </h3>
<div class="outline-text-3" id="text-2.2">

</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> <span class="todo TODO"> TODO</span> Add a new System </h3>
<div class="outline-text-3" id="text-2.3">

</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> <span class="todo TODO"> TODO</span> Add a new Game </h3>
<div class="outline-text-3" id="text-2.4">

</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5"><span class="section-number-3">2.5</span> <span class="todo TODO"> TODO</span> Better flow </h3>
<div class="outline-text-3" id="text-2.5">

<ol>
<li>
page loads: see list of systems
</li>
<li>
click on system to see list of games
</li>
<li>
have back/home button to return to list of games
</li>
<li>
flows do not load new pages, it is all done in-app
</li>
</ol>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Nick F
<a href="mailto:nick@desktop2">&lt;nick@desktop2&gt;</a>
</p>
<p class="date"> Date: 2014-03-25</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
